In [1]:
# Add Pandas dependency.
import pandas as pd

# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

#Read the school data file and stroe it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df.tail(3)

    School ID          school_name      type  size   budget
12         12  Johnson High School  District  4761  3094650
13         13     Ford High School  District  2739  1763916
14         14   Thomas High School   Charter  1635  1043130

In [2]:
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60

In [3]:
# To confirm if there is null in values from schools_data.df
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [4]:
# To confirm if there is null in values from student_data.df
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [5]:
# Determine if there are any missing values in the school data.
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [6]:
# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [7]:
# Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [8]:
# Determine if there are any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [9]:
# Determine data types for the school DataFrame.
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [10]:
# Determine data type for budget column in school_data_df
# school_data_df["budget"].dtype
school_data_df.budget.dtype

dtype('int64')

In [11]:
# Determine data types for the student DataFrame.
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [12]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [13]:
# Iterate through the "prefixes_suffixes" list and replace them with an empty space, "" when it appears in the student's name.

for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "")

/Users/jinike/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  after removing the cwd from sys.path.

In [14]:
student_data_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [15]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [16]:
# Get the total number of students.
student_count = school_data_complete_df.count()
student_count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [17]:
school_data_complete_df["Student ID"].count()

39170

In [18]:
# Calculate the total number of schools
school_count_2 = school_data_complete_df["school_name"].unique()

In [19]:
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [20]:
school_count = len(school_count_2)
school_count

15

In [21]:
# Calculate the total budget.

total_budget = school_data_df["budget"].sum()
print(f"{total_budget:,}")

24,649,428

In [22]:
# Calculate the average reading score.

average_reading_score = school_data_complete_df["reading_score"].mean()
print(f"{average_reading_score:.2f}")

81.88

In [23]:
# Calculate the average math score.

average_math_score = school_data_complete_df["math_score"].mean()
print(f"{average_math_score:.2f}")

78.99

In [24]:

passing_reading = school_data_complete_df["reading_score"] >= 70

In [25]:
# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [26]:
# Get all the students who are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [27]:
# Calculate the number of students passing math.
passing_math_count = passing_math["Student ID"].count()

# Calculate the number of students passing reading.
passing_reading_count = passing_reading["student_name"].count()

In [28]:
print(passing_math_count)

29370

In [29]:
print(passing_reading_count)

33610

In [30]:
student_count = school_data_complete_df["Student ID"].count()

In [31]:
# Calculate the percent that passed math.
passing_math_percentage = (passing_math_count / student_count) * 100
print(f"{passing_math_percentage:.2f}")

# Calculate the percent that passed reading.
passing_reading_percentage = (passing_reading_count / student_count) * 100
print(f"{passing_reading_percentage:.2f}")

74.98
85.81

In [32]:
# Calculate the students who passed both math and reading.

overall_passing_math_reading = school_data_complete_df[((school_data_complete_df["math_score"]>=70) & (school_data_complete_df["reading_score"]>=70))]
overall_passing_math_reading_count = overall_passing_math_reading["Student ID"].count()
overall_passing_math_reading_count

25528

In [33]:
# Calculate the overall passing percentage.

overall_passing_percentage = overall_passing_math_reading_count/student_count * 100
print(f"{overall_passing_percentage:.2f}")

65.17

In [34]:
# Adding a list of values with keys to create a new DataFrame.

district_summary_df = pd.DataFrame(
    [
        {"Total Schools": school_count,
        "Total Students": student_count,
        "Total Budget": total_budget,
        "Average Math Score": average_math_score,
        "Average Reading score": average_reading_score,
        "% Passing Math": passing_math_percentage,
        "% Passing Reading": passing_reading_percentage,
        "% Overall passing": overall_passing_percentage}
    ])

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [35]:
# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170",24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [36]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

In [37]:
#The "Average Reading Score" column will be formatted to one decimal place.
district_summary_df["Average Reading score"] = district_summary_df["Average Reading score"].map("{:.1f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",78.985371,81.9,74.980853,85.805463,65.172326

In [38]:
#The "Average Math Score" column will be formatted to one decimal place.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",79.0,81.9,74.980853,85.805463,65.172326

In [39]:
#The "% Passing Reading" column will be formatted to the nearest whole number percentage.
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,85.805463,65.172326

In [40]:
#The "% Passing Math" column will be formatted to the nearest whole number percentage
district_summary_df["% Passing Reading"] = district_summary_df['% Passing Reading'].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65.172326

In [41]:
#The "% Overall Passing" column will be formatted to the nearest whole number percentage.
district_summary_df["% Overall passing"] = district_summary_df['% Overall passing'].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [46]:
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading score", "% Passing Math", "% Passing Reading", "% Overall passing"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading score,% Passing Math,% Passing Reading,% Overall passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65